//
//  MarketDataModel.swift
//  CryptoTracker
//
//  Created by Валерий Зазулин on 28.11.2023.
//

import Foundation

// JSON Data:
/*
 URL: https://api.coingecko.com/api/v3/global
 
 JSON Response:
 {
   "data": {
     "active_cryptocurrencies": 11135,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 935,
     "total_market_cap": {
       "btc": 39466646.5529668,
       "eth": 724126094.6387316,
       "ltc": 21201876782.409817,
       "bch": 6575233847.539519,
       "bnb": 6452809972.79409,
       "eos": 2173473748105.3762,
       "xrp": 2434590741501.0684,
       "xlm": 12638960667269.922,
       "link": 103284324597.35796,
       "dot": 284996638100.38605,
       "yfi": 173940661.50531152,
       "usd": 1468774781560.4482,
       "aed": 5394369140237.055,
       "ars": 527241383257451.4,
       "aud": 2221780361471.732,
       "bdt": 161958218696077.34,
       "bhd": 553707529801.3474,
       "bmd": 1468774781560.4482,
       "brl": 7192590105301.506,
       "cad": 1999219856371.4392,
       "chf": 1292803812531.254,
       "clp": 1277195461651738.2,
       "cny": 10474714232176.475,
       "czk": 32572871453187.887,
       "dkk": 9994555599561.768,
       "eur": 1340447928895.5125,
       "gbp": 1162663023011.0913,
       "hkd": 11441364854263.992,
       "huf": 508857023071616.2,
       "idr": 22773940498007376,
       "ils": 5448493490937.558,
       "inr": 122440806760247.47,
       "jpy": 217925198767164.84,
       "krw": 1907129965918710,
       "kwd": 452814452506.3978,
       "lkr": 483688543453556.44,
       "mmk": 3084802670145899.5,
       "mxn": 25227129263863.516,
       "myr": 6880475464219.919,
       "ngn": 1175862324744483.8,
       "nok": 15621371567953.797,
       "nzd": 2407689060672.9634,
       "php": 81428876827260.95,
       "pkr": 417157099667265.06,
       "pln": 5829199914318.008,
       "rub": 130790274384695.72,
       "sar": 5508708850657.171,
       "sek": 15311974160218.11,
       "sgd": 1963392033124.8337,
       "thb": 51480556093693.55,
       "try": 42466832136735.27,
       "twd": 46316343961727.01,
       "uah": 53262382594646.38,
       "vef": 147068418877.64752,
       "vnd": 35602350641401230,
       "zar": 27416296950085.457,
       "xdr": 1103681434107.9668,
       "xag": 59594258927.75509,
       "xau": 729202615.8013138,
       "bits": 39466646552966.805,
       "sats": 3946664655296680.5
     },
     "total_volume": {
       "btc": 1932236.3791836218,
       "eth": 35452284.533456,
       "ltc": 1038016685.0750904,
       "bch": 321915013.09351295,
       "bnb": 315921297.25686926,
       "eos": 106410486121.58026,
       "xrp": 119194439102.8674,
       "xlm": 618787298373.442,
       "link": 5056668017.602896,
       "dot": 13953069748.237804,
       "yfi": 8515911.619923586,
       "usd": 71909328854.42316,
       "aed": 264101392083.63974,
       "ars": 25813061669019.855,
       "aud": 108775515934.19337,
       "bdt": 7929266593561.472,
       "bhd": 27108810247.51358,
       "bmd": 71909328854.42316,
       "brl": 352139983400.1097,
       "cad": 97879239151.54027,
       "chf": 63294015983.03241,
       "clp": 62529851149620.8,
       "cny": 512828569658.20325,
       "czk": 1594725995071.656,
       "dkk": 489320619053.0749,
       "eur": 65626610792.412224,
       "gbp": 56922489899.8863,
       "hkd": 560154543894.4808,
       "huf": 24912986981614.848,
       "idr": 1114982907619372.8,
       "ils": 266751250851.92526,
       "inr": 5994544806365.299,
       "jpy": 10669338131721.35,
       "krw": 93370636267102.36,
       "kwd": 22169214629.845577,
       "lkr": 23680770510892.156,
       "mmk": 151027980901777.72,
       "mxn": 1235087882133.238,
       "myr": 336859251018.54517,
       "ngn": 57568710777934.66,
       "nok": 764802309611.8868,
       "nzd": 117877367324.61308,
       "php": 3986653335507.884,
       "pkr": 20423476383534.418,
       "pln": 285390148890.99084,
       "rub": 6403324028818.948,
       "sar": 269699317606.96902,
       "sek": 749654609488.7036,
       "sgd": 96125154892.79427,
       "thb": 2520421976347.5234,
       "try": 2079121616100.8157,
       "twd": 2267588776095.3716,
       "uah": 2607657915735.328,
       "vef": 7200281098.193382,
       "vnd": 1743045409278522.5,
       "zar": 1342266723329.5466,
       "xdr": 54034826981.07915,
       "xag": 2917658457.1521087,
       "xau": 35700824.49635536,
       "bits": 1932236379183.6218,
       "sats": 193223637918362.2
     },
     "market_cap_percentage": {
       "btc": 49.54769971727945,
       "eth": 16.618188522303416,
       "usdt": 6.058997286841757,
       "bnb": 2.385093621434482,
       "xrp": 2.212018772035035,
       "usdc": 1.668107018387499,
       "sol": 1.5872383581609182,
       "steth": 1.2748905304100808,
       "ada": 0.898329930876873,
       "doge": 0.7575367659951375
     },
     "market_cap_change_percentage_24h_usd": -1.568770396853906,
     "updated_at": 1701127872
   }
 }
 
 */

struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc"}) {
            return item.value.asPercentString()
        }
        return ""
    }
}
